app/controllers/students_controller.rb

  def show
  	@student = Student.find(set_student)
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT 1  [["id", 3]]

  def edit
  	@student = Student.find(set_student)
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT 1  [["id", 2]]

  def create
    student = Student.create(student_params)
---
INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Josh"], ["last_name", "West-Burnham"], ["created_at", "2016-08-19 18:28:47.060274"], ["updated_at", "2016-08-19 18:28:47.060274"]]

  def update
		student = Student.find(set_student)
    student.update(student_params)
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT 1  [["id", 2]]
UPDATE "students" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Lindsey"], ["last_name", "Stirling"], ["updated_at", "2016-08-19 18:34:55.080932"], ["id", 1]]